CHECK_FIGHT = {
    'pos': (963, 64),
    'col': (252, 200, 63)
}

# координаты кнопок способностей
ABILITY_1 = (727, 965)
ABILITY_2 = (886, 964)
ABILITY_3 = (1043, 961)
ABILITY_4 = (1219, 975)


CHANGE_ABILITY_BUTTON_LEFT_POS = (1333, 966)


ABILITY_MENU = {
    'pos': (1008, 922),
    'col': (180, 197, 221)
} 

CLOSE_MENU = {
    'pos': (958, 387),
    'col': (179, 199, 224) 
}

CLOSE_FIGHT_BUTTON = (958, 761)

# координаты для проверки поднятия уровня
LVL_UP_MIS_1 = (663, 452)
LVL_COLOR_1 = (219, 207, 48)

LVL_UP_MIS_2 = (806, 452)
LVL_COLOR_2 = (218, 206, 47)

LVL_UP_MIS_3 = (663, 545)
LVL_COLOR_3 = (222, 210, 63)

LVL_UP_MIS_4 = (806, 546)
LVL_COLOR_4 = (218, 206, 47)

ABILITY_LVL_MENU = {
    'pos': (1102, 590),
    'col': (102, 123, 145)
}
ABILITY_LVL_MENU_CLOSE_BUTTON = (960, 642)
ABILITY_LVL_MENU_CLOSE_BUTTON_2 = (951, 766)
ABILITY_LVL_MENU_CLOSE_BUTTON_3 = (957, 727)

LVL_UP_MENU_BUTTON = (449, 74)

LVL_UP_MENU_MIS = [(743, 299), (750, 347), (761, 404), (755, 452)]

LVL_UP_BUTTON_1 = (997, 260)
LVL_UP_BUTTON_2 = (1111, 835)

CLOSE_LVL_UP_BUTTON = (1313, 234)



TYPR_MIS_POS = (1130, 46)

TYPE_MIS_COL = {
    'common': (97, 97, 97),
    'rare': [(60, 100, 223), (36, 73, 185)],
    'epic': [(20, 160, 20), (77, 220, 77)],
    'exotic': [(197, 0, 197), (222, 18, 222)],
    'legendary': [(255, 126, 0), (255, 247, 0)]
}

CHECK_HP_MIS = {
    'pos': (1175, 97),
    'col': (93, 114, 107)
}

CATCH_BUTTON_POS = (960, 139)
SKIP_BUTTON = {
    'pos': (973, 588),
    'col': (222, 179, 134)
}
KEEP_BUTTON = (1057, 605)

# замеры локаций
LOC_1_1 = (1005, 678)
LOC_1_2 = (913, 173)

LOC_2_1 = (752, 665)
LOC_2_2 = (1161, 330)


LOC_3_1 =  (1154, 403)
LOC_3_2 = (750, 433)

# локация 3 двухстихийный из зеленого цветка
LOC_4_1 =  (730, 529)
LOC_4_2 = (1191, 495)

# огненный заяц на первой локации
LOC_5_1 = (465, 610)
LOC_5_2 = (1434, 367)


LOC_6_1 = (1151, 616)
LOC_6_2 = (771, 347)


LOC_7_1 = (804, 187)
LOC_7_2 = (1128, 733)

LOC_8_1 = (804, 187)
LOC_8_2 = (1128, 733)


# дом коллекционера

# Papa
LOC_9_1 = (1481, 452)
LOC_9_2 = (445, 490)

# Звезда
LOC_10_1 = (888, 390)
LOC_10_2 = (1085, 594)


# Вода + ветер слизень
LOC_11_1 = (1145, 412)
LOC_11_2 = (769, 548)

LOC_12_1 = (1281, 408)
LOC_12_2 = (637, 602)


# LOC_13_1 = (1150, 267)
# LOC_13_2 = (775, 652)

# координаты кнопки close лвл апа героя

SKIP_BUTTON_POS = (960, 724)
SKIP_MENU = {
    'pos':  (1061, 480),
    'col': (104, 125, 144)
}
# Координаты: (961, 724), цвет RGB: (0, 85, 138)



# оординаты: (1171, 99), цвет RGB: (78, 99, 93)
# Координаты: (1179, 97), цвет RGB: (96, 117, 108)
# Координаты: (1183, 98), цвет RGB: (86, 109, 99)
# Координаты: (1189, 98), цвет RGB: (90, 114, 101)
# Координаты: (1190, 98), цвет RGB: (91, 115, 102)
# Координаты: (1170, 98), цвет RGB: (77, 98, 92)
# Координаты: (1167, 98), цвет RGB: (75, 96, 91)
# Координаты: (1172, 99), цвет RGB: (79, 100, 94)
# Координаты: (1172, 97), цвет RGB: (92, 111, 106)
# Координаты: (1167, 98), цвет RGB: (75, 96, 91)
# Координаты: (954, 130), цвет RGB: (191, 118, 49)
# Координаты: (1011, 293), цвет RGB: (121, 181, 47)
# Координаты: (1056, 345), цвет RGB: (103, 160, 46)